-- 数据集
return {
    -- 省
    {
        name = "河北省",
        capital = "石家庄市",
        cities = {
            "石家庄市", "唐山市", "秦皇岛市", "邯郸市",
            "邢台市", "保定市", "张家口市", "承德市", "沧州市",
            "廊坊市", "衡水市", "雄安新区"
        }
    }, {
        name = "山西省",
        capital = "太原市",
        cities = {
            "太原市", "大同市", "阳泉市", "长治市", "晋城市",
            "朔州市", "晋中市", "运城市", "吕梁市", "忻州市",
            "临汾市", "吕梁市"
        }
    }, {
        name = "辽宁省",
        capital = "沈阳市",
        cities = {
            "沈阳市", "大连市", "鞍山市", "抚顺市", "本溪市",
            "丹东市", "锦州市", "营口市", "阜新市", "辽阳市",
            "盘锦市", "铁岭市", "朝阳市", "葫芦岛市"
        }
    }, {
        name = "吉林省",
        capital = "长春市",
        cities = {
            "长春市", "吉林市", "四平市", "辽源市", "通化市",
            "白山市", "松原市", "白城市", "延边朝鲜族自治州"
        }
    }, {
        name = "黑龙江省",
        capital = "哈尔滨市",
        cities = {
            "哈尔滨市", "齐齐哈尔市", "牡丹江市", "佳木斯市",
            "大庆市", "伊春市", "鸡西市", "鹤岗市", "双鸭山市",
            "七台河市", "绥化市", "黑河市", "大兴安岭地区"
        }
    }, {
        name = "江苏省",
        capital = "南京市",
        cities = {
            "南京市", "无锡市", "徐州市", "常州市", "苏州市",
            "南通市", "连云港市", "淮安市", "盐城市", "扬州市",
            "镇江市", "泰州市", "宿迁市"
        }
    }, {
        name = "浙江省",
        capital = "杭州市",
        cities = {
            "杭州市", "宁波市", "温州市", "绍兴市", "湖州市",
            "嘉兴市", "金华市", "衢州市", "台州市", "丽水市",
            "舟山市"
        }
    }, {
        name = "安徽省",
        capital = "合肥市",
        cities = {
            "合肥市", "芜湖市", "蚌埠市", "淮南市", "马鞍山市",
            "淮北市", "铜陵市", "安庆市", "黄山市", "阜阳市",
            "宿州市", "滁州市", "六安市", "宣城市", "池州市",
            "亳州市"
        }
    }, {
        name = "福建省",
        capital = "福州市",
        cities = {
            "福州市", "莆田市", "泉州市", "厦门市", "漳州市",
            "龙岩市", "三明市", "南平市", "宁德市"
        }
    }, {
        name = "江西省",
        capital = "南昌市",
        cities = {
            "南昌市", "赣州市", "宜春市", "吉安市", "上饶市",
            "抚州市", "九江市", "景德镇市", "萍乡市", "新余市",
            "鹰潭市"
        }
    }, {
        name = "山东省",
        capital = "济南市",
        cities = {
            "济南市", "青岛市", "淄博市", "枣庄市", "东营市",
            "烟台市", "潍坊市", "济宁市", "泰安市", "威海市",
            "日照市", "德州市", "滨州市", "聊城市", "临沂市",
            "菏泽市"
        }
    }, {
        name = "河南省",
        capital = "郑州市",
        cities = {
            "郑州市", "开封市", "洛阳市", "平顶山市", "安阳市",
            "鹤壁市", "新乡市", "焦作市", "濮阳市", "许昌市",
            "漯河市", "三门峡市", "商丘市", "周口市",
            "驻马店市", "南阳市", "信阳市"
        }
    }, {
        name = "湖北省",
        capital = "武汉市",
        cities = {
            "武汉市", "黄石市", "十堰市", "荆州市", "宜昌市",
            "襄阳市", "鄂州市", "荆门市", "黄冈市", "孝感市",
            "咸宁市", "恩施土家族苗族自治州", "随州市"
        }
    }, {
        name = "湖南省",
        capital = "长沙市",
        cities = {
            "长沙市", "株洲市", "湘潭市", "衡阳市", "邵阳市",
            "张家界市", "岳阳市", "益阳市", "常德市", "娄底市",
            "郴州市", "永州市", "怀化市",
            "湘西土家族苗族自治州"
        }
    }, {
        name = "广东省",
        capital = "广州市",
        cities = {
            "广州市", "深圳市", "珠海市", "汕头市", "佛山市",
            "韶关市", "湛江市", "肇庆市", "江门市", "茂名市",
            "惠州市", "梅州市", "汕尾市", "河源市", "阳江市",
            "清远市", "东莞市", "中山市", "潮州市", "揭阳市",
            "云浮市"
        }
    }, {
        name = "海南省",
        capital = "海口市",
        cities = {"三亚市", "海口市", "三沙市", "儋州市"}
    }, {
        name = "四川省",
        capital = "成都市",
        cities = {
            "成都市", "自贡市", "攀枝花市", "泸州市", "德阳市",
            "绵阳市", "广元市", "遂宁市", "内江市", "乐山市",
            "南充市", "眉山市", "宜宾市", "广安市", "达州市",
            "雅安市", "巴中市", "资阳市"
        }
    }, {
        name = "贵州省",
        capital = "贵阳市",
        cities = {
            "贵阳市", "六盘水市", "遵义市", "铜仁市", "毕节市",
            "安顺市"
        }
    }, {
        name = "云南省",
        capital = "昆明市",
        cities = {
            "昆明市", "曲靖市", "玉溪市", "昭通市", "保山市",
            "丽江市", "普洱市", "临沧市"
        }
    }, {
        name = "陕西省",
        capital = "西安市",
        cities = {
            "西安市", "铜川市", "宝鸡市", "咸阳市", "渭南市",
            "汉中市", "安康市", "商洛市", "延安市", "榆林市"
        }
    }, {
        name = "甘肃省",
        capital = "兰州市",
        cities = {
            "兰州市", "嘉峪关市", "金昌市", "白银市", "天水市",
            "酒泉市", "张掖市", "武威市", "定西市", "陇南市",
            "平凉市", "庆阳市", "临夏回族自治州",
            "甘南藏族自治州"
        }
    }, {
        name = "青海省",
        capital = "西宁市",
        cities = {
            "海北藏族自治州", "黄南藏族自治州",
            "海南藏族自治州", "果洛藏族自治州",
            "玉树藏族自治州", "海西蒙古族藏族自治州",
            "西宁市", "海东市"
        }
    }, -- 自治区
    {
        name = "内蒙古自治区",
        capital = "呼和浩特市",
        cities = {
            "呼和浩特市", "包头市", "乌海市", "赤峰市",
            "呼伦贝尔市", "鄂尔多斯市", "通辽市",
            "乌兰察布市", "巴彦淖尔市", "兴安盟",
            "锡林郭勒盟", "阿拉善盟"
        }
    }, {
        name = "广西壮族自治区",
        capital = "南宁市",
        cities = {
            "南宁市", "柳州市", "桂林市", "梧州市", "北海市",
            "崇左市", "来宾市", "贺州市", "玉林市", "百色市",
            "河池市", "钦州市", "防城港市", "贵港市"
        }
    }, {
        name = "西藏自治区",
        capital = "拉萨市",
        cities = {
            "拉萨市", "昌都市", "山南市", "日喀则市", "那曲市",
            "阿里地区", "林芝市"
        }
    }, {
        name = "宁夏回族自治区",
        capital = "银川市",
        cities = {
            "银川市", "石嘴山市", "吴忠市", "固原市", "中卫市"
        }
    }, {
        name = "新疆维吾尔自治区",
        capital = "乌鲁木齐市",
        cities = {
            "乌鲁木齐市", "克拉玛依市", "吐鲁番市", "哈密市",
            "昌吉回族自治州", "博尔塔拉蒙古自治州",
            "巴音郭楞蒙古自治州", "阿克苏地区",
            "克孜勒苏柯尔克孜自治州", "喀什地区", "和田地区",
            "伊犁哈萨克自治州", "塔城地区", "阿勒泰地区"
        }
    }, -- 直辖市
    {name = "北京市", capital = "北京市", cities = {"北京市"}},
    {name = "天津市", capital = "天津市", cities = {"天津市"}},
    {name = "上海市", capital = "上海市", cities = {"上海市"}},
    {name = "重庆市", capital = "重庆市", cities = {"重庆市"}}, -- 港澳台
    {
        name = "香港特别行政区",
        capital = "香港",
        cities = {
            "元朗区", "九龙城区", "湾仔区", "油尖旺区",
            "沙田区", "深水埗区", "西贡区", "黄大仙区",
            "离岛区", "中西区", "大埔区", "荃湾区", "葵青区",
            "北区", "屯门区", "观塘区", "南区", "东区"
        }
    }, {
        name = "澳门特别行政区",
        capital = "澳门",
        cities = {
            "花地玛堂区", "圣安多尼堂区", "嘉模堂区",
            "大堂区", "望德堂区", "圣方济各堂区",
            "圣老楞佐堂区"
        }

    }, {
        name = "台湾省",
        capital = "台北",
        cities = {
            "台北市", "新北市", "桃园市", "台中市", "台南市",
            "高雄市", "基隆市", "新竹市", "嘉义市", "新竹县",
            "苗栗县", "彰化县", "南投县", "云林县", "嘉义县",
            "屏东县", "台东县", "花莲县", "宜兰县", "澎湖县"
        }
    }
}
